-- 项目下有多个则命令为 V1,V2 递增，中间01,02代表当前sql的版本新增，每次新增的请把之前的sql注释,最后代表当前的sql的描述


---------------------------------版本1------------------------------------------------------
-- -- ------
-- -- 公海池
-- -- ------
--
-- INSERT INTO `yjj_work_user` (`login_name`, `user_name`, `user_type`, `email`, `phonenumber`, `sex`, `avatar`, `password`, `salt`, `status`, `del_flag`, `login_ip`, `login_date`, `create_by`, `create_time`, `update_by`, `update_time`, `remark`) VALUES
-- ('huwei', '胡威', '11', '', '15958150974', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'yangjiangbei', '杨江北', '01', '', '13311555992', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'liuxiang', '刘翔', '01', '', '13067921513', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'tangyingjie', '唐英杰', '01', '', '13067735681', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'yuanzongxian', '袁宗献', '01', '', '15805810030', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'yewanzhen', '叶婉贞', '01', '', '18857810549', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'zhaokai', '赵楷', '01', '', '18158139233', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'daizijun', '戴子军', '01', '', '18005707060', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'xuchuang', '许闯', '01', '', '17601231856', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'pengciguo', '彭赐果', '01', '', '13069727359', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'wuqing', '吴青', '01', '', '18696243385', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, ''),
-- ( 'zhangqian', '张倩', '11', '', '18605811788', '0', '', 'E10ADC3949BA59ABBE56E057F20F883E', '', '0', '0', '', NULL, '', NULL, '', NULL, '')
--

---------------------------------版本1------------------------------------------------------

