package com.goldplusgold.td.sltp.core.auth.exception;

/**
 * 描述：返回给TD用户的错误信息枚举常量 TDXXXX
 */
public enum TDErrorEnum {

    TD0001("TD0001", "请先登录金专家."), //需确认前端时间使用场景
    TD0002("TD0002", "请重新登录金专家."), //金专家TOKEN已过期
    TD0003("TD0003", "客户号未与金专家账户绑定."),
    TD0004("TD0004", "请先登录TD账户."),
    TD0005("TD0005", "登录异常，请尝试重新登录或者联系客服."), //登录时权限验证出现异常
    TD0006("TD0006", "登出时发生异常."),
    TD0007("TD0007", "资金转入转出发生异常，请稍后重试"),
    TD0008("TD0008", "查询余额时发生异常，请稍后重试"),
    TD0009("TD0009", "查询当日转账记录发生异常，请稍后重试"),
    TD0010("TD0010", "查询历史转账记录发生异常，请稍后重试"),
    TD0011("TD0011", "查询日结单发生异常，请稍后重试"),
    TD0012("TD0012", "日结单确认发生异常，请稍后重试"),
    TD0013("TD0013", "交易异常，请稍后重试"),
    TD0014("TD0014", "交易异常，请联系客服或稍后重试."), //后续需要细化
    TD0015("TD0015", "获取下单交易方式发生异常，请稍后重试"),
    TD0016("TD0016", "获取个人客户信息发生异常，请稍后重试"),
    TD0017("TD0017", "查询委托记录发生异常，请稍后重试"),
    TD0018("TD0018", "撤单发生异常，请稍后重试"),
    TD0019("TD0019", "密码修改发生异常，请稍后重试"),
    TD0020("TD0020", "获取持仓信息发生异常，请稍后重试"),
    TD0021("TD0021", "获取当日成交信息发生异常，请稍后重试"),
    TD0022("TD0022", "获取历史成交信息发生异常，请稍后重试"),
    TD0023("TD0023", "获取成交信息发生异常，请稍后重试"),
    TD0024("TD0024", "查询转账记录发生异常，请稍后重试"),
    TD0025("TD0025", "请填写完所有信息后，再提交"),
    TD0026("TD0026", "查询发生异常，请稍后重试"),//分页查询多条记录时页码丢失
    TD0027("TD0027", "查询页码有误，请稍后重试"), //暂未使用
    TD0028("TD0028", "客户号和密码不能为空"),
    TD0029("TD0029", "客户号或密码不正确"),
    TD0030("TD0030", "当前客户号已经绑定过金专家账户"),
    TD0031("TD0031", "您的金专家账户已经绑定过其他TD客户号");

    /**
     * 错误编码
     */
    String code;

    /**
     * 错误信息
     */
    String info;

    TDErrorEnum(String code, String info) {
        this.code = code;
        this.info = info;
    }

    public String toCode() {
        return this.code;
    }

    public String toInfo() {
        return this.info;
    }
}
